type errors mkc
